package service

// ===================================================================
// 服务端口规范
// 20001 <= p <= 20499 基础服务 一般业务服务不要占用 例如: crontab 等
// 21001 <= p <= 21999 业务服务
// 20501 <= p <= 20999 保留端口
//
// 小知识: k8s NodePort 默认端口范围 30000-32767
// ===================================================================

// ======== 基础服务 ==========

// Crontab 定时任务
func Crontab() Service {
	return NewService("crontab", 20001)
}

// Cadmin 后台管理
func Cadmin() Service {
	return NewService("cadmin", 20002)
}
